// تبدیل کد آب و هوا به توضیح فارسی
export const getWeatherDescription = (code) => {
    const codes = {
        0: 'آسمان صاف',
        1: 'عمدتاً صاف',
        2: 'نیمه ابری',
        3: 'ابری',
        45: 'مه',
        48: 'مه یخ‌زده',
        51: 'نم‌نم باران سبک',
        53: 'نم‌نم باران',
        55: 'نم‌نم باران شدید',
        61: 'باران سبک',
        63: 'باران',
        65: 'باران شدید',
        71: 'برف سبک',
        73: 'برف',
        75: 'برف شدید',
        80: 'رگبار سبک',
        81: 'رگبار',
        82: 'رگبار شدید',
        95: 'رعد و برق',
        96: 'رعد و برق با تگرگ',
        99: 'رعد و برق شدید با تگرگ',
    };
    return codes[code] || 'نامشخص';
};